// 在(700,400)处创建一个多边形
poly = instance_create_depth(700, 400, 0, oPolyBorderAdv);
// 设定多边形的顶点
poly.verts = [
	[300, 0], [200, 100], [300, 200], [200, 300], [100, 200], 
	[0, 300], [-100, 200], [-200, 300], [-300, 200], [-200, 100], 
	[-300, 0], [-200, -100], [-300, -200], [-200, -300], [-100, -200], 
	[0, -300], [100, -200], [200, -300], [300, -200], [200, -100]
];
// 将顶点转为线（因为是单个多边形所以这么做，后面的例子就是用mixPoly了）
lines = vertsToLines(poly.verts, poly.x, poly.y, poly.rot);

// 玩家的坐标
playerX = 0;
playerY = 0;
