// 一个加框和减框的例子
// 包含: 玩家移动限制，多边形旋转，加减框

// 在(700,400)处创建一个多边形
poly = instance_create_depth(700, 400, 0, oPolyBorderAdv);
// 设定多边形的顶点
poly.verts = [
	[300, 0], [200, 100], [300, 200], [200, 300], [100, 200], 
	[0, 300], [-100, 200], [-200, 300], [-300, 200], [-200, 100], 
	[-300, 0], [-200, -100], [-300, -200], [-200, -300], [-100, -200], 
	[0, -300], [100, -200], [200, -300], [300, -200], [200, -100]
];

// 创建一个多边形，横坐标在Step中控制
poly1 = instance_create_depth(0, 600, 0, oPolyBorderAdv);
// 设定多边形的顶点
poly1.verts = [[100, 100], [-100, 100], [-100, -100], [100, -100]];
// 设定多边形旋转速度
poly1.rotSpeed = 1;

// 创建一个多边形，横坐标在Step中控制
poly2 = instance_create_depth(0, 200, 0, oPolyBorderAdv);
// 设定多边形的顶点
poly2.verts = [[100, 100], [-100, 100], [-100, -100], [100, -100]];
// 设定多边形旋转速度
poly2.rotSpeed = 1;
// 将多边形的运算类型设定为“减框”
poly2.operFlag = OperateFlag.OF_Sub;

// 记录运算后的结果
mixed = [];

// 玩家的坐标
playerX = 0;
playerY = 0;
